doc/RoboticsMB_Reference.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Robotics Merit Badge Class Reference</title>
<!-- 2016-07-03 Sun 23:48 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Maurice Ling" />
</head>
<body>
<div id="content">
<h1 class="title">Robotics Merit Badge Class Reference</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Introduction</a></li>
<li><a href="#sec-2">2. Items to bring for each Session</a></li>
<li><a href="#sec-3">3. Computer Requirements</a>
<ul>
<li><a href="#sec-3-1">3.1. EdWare Programming software</a></li>
</ul>
</li>
<li><a href="#sec-4">4. Other Items You Will Need</a></li>
<li><a href="#sec-5">5. References</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
This document contains useful information for the 
2016 Troop 675 Irvine Robotics Merit Badge class.
</p>

<p>
Copyright © 2016 Maurice Ling
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Items to bring for each Session</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>Laptop/computer/tablet with EdWare access. (see Section: <a href="#sec-3">3</a>)
</li>
<li>Power adapter/cable.
</li>
<li>Pen/pencil for taking notes
</li>
<li>Robotics Notebook and Ediston Robot Kit (distributed in first class)
</li>
<li>Charged AAA batteries (bring 4 alkaline AAA batteries for first class)
</li>
<li><a href="http://www.apu.edu/library/educationalprograms/stemnova/downloads/prerequisites/Robotics.pdf">Workbook</a> (Print out for first class)
</li>
<li>Blue Card signed by Scoutmaster
</li>
<li>EdCom programming cable (included with Edison Robot)
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Computer Requirements</h2>
<div class="outline-text-2" id="text-3">
<p>
You need a computer or tablet (Mac, Windows PC, or Linux) with audio output
capability and standard 1/8" audio jack.  Wifi is highly recommended.
</p>
</div>

<div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> EdWare Programming software</h3>
<div class="outline-text-3" id="text-3-1">
<p>
The class will be taught using the on-line version of Edware.  The on-line 
version allows you to share programs with each other, which is useful
if you need help with debugging your program.
</p>

<p>
EdWare is available <a href="http://edwareapp.com/?_ga=1.185565985.982237356.1463279107#">on-line</a> for free via web browser.  Create an account via 
<b>Menu-&gt;Login</b>
</p>

<p>
For off-line access, versions for Windows, Mac, Linux, Android, iOS
are also freely available at
<a href="https://meetedison.com/robot-programming-software/">https://meetedison.com/robot-programming-software/</a>.  You may try
these out for a back up to the online version, but the online version is preferred 
and has more features.  If you want to program without a network connection,
install one of these alternatives.
</p>
</div>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Other Items You Will Need</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>Blue Card with the Scoutmaster’s signature.
</li>
<li>AAA NiMH battery charger (the kit you will receive will include
AAA NiMH batteries).
</li>
<li>A small work area at home you can use to work on your robot.
</li>
<li>Sony compatible or universal IR remote
</li>
<li>Legos.  I will have a limited number of random special connector Lego
parts available, but you will be expected to provide the
majority of Lego parts for your robot.  If you'd like to
purchase a set, the "Compact Tracked Loader" (Lego set 42032)
has useful parts and is used as an example in some of the
documentation from EdWare. (Useful, but not required)
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> References</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li><a href="https://meetedison.com/content/EdBooks/EdBook1-Your-EdVenture-into-Robotics-You-re-a-Controller.pdf">EdBook 1 - You're a Controller</a>
</li>
<li><a href="https://meetedison.com/content/EdBooks/EdBook2-Your-EdVenture-into-Robotics-You-re-a-Programmer.pdf">EdBook 2 - You're a Programmer</a>
</li>
<li><a href="https://meetedison.com/content/EdBooks/EdBook3-Your-EdVenture-into-Robotics-You-re-a-Builder.pdf">EdBook 3 - You're a Builder</a>
</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2016-07-03</p>
<p class="author">Author: Maurice Ling</p>
<p class="date">Created: 2016-07-03 Sun 23:48</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
